const province = {
  tang: ["江南東道", "關內道", "河東道", "都畿道", "河北道", "河南道", "嶺南道", "黔中道", "劍南道", "隴右道", "山南西道", "山南東道", "江南西道", "淮南道", "京畿道"],
  song: ["成都府路", "福建路", "廣南東路", "廣南西路", "河北東路", "河北西路", "河東路", "淮南東路", "淮南西路", "京東東路", "京東西路", "荊湖北路", "荊湖南路", "京畿路", "江南東路", "江南西路", "京西北路", "京西南路", "夔州路", "利州路", "兩浙路", "秦鳳路", "永興軍路", "梓州路"],
  yuan: ["瓊州", "琉球", "湖广行中書省", "河南江北行中書省", "宣政院轄地", "遼陽行中書省", "江西行中書省", "四川行中書省", "雲南行中書省", "山西行中書省", "甘肅行中書省", "察合台漢國", "嶺北行中書省", "中書省", "江浙行中書省"],
  ming: ["貴州布政司", "山東布政司", "江西布政司", "河南布政司", "遼寧布政司", "山西布政司", "安徽布政司", "福建布政司", "浙江布政司", "江蘇布政司", "海南布政司", "台灣布政司", "京師布政司", "廣東布政司", "奴兒干都司", "陝西布政司", "湖廣布政司", "交險布政司", "乌丝藏独丝", "四川布政司", "雲南布政司"],
  qing: ["新疆省", "西藏省", "青海省", "雲南省", "廣西省", "湖南省", "陝西省", "湖北省", "貴州", "山東省", "江西省", "河南省", "遼寧省", "山西省", "安徽省", "福建省", "浙江省", "江蘇省", "海南省", "台灣省", "烏里雅蘇臺", "京师", "甘肅省", "內蒙古省", "吉林省", "庫頁島", "黑龍江省", "四川省", "廣東省"],
}
export default province

const response = [
  {
    "id": 1316,
    "chName": "孟居仁",
    "firstyear": "未詳",
    "lastyear": "未詳",
    "office_name": "副提舉",
    "office_address": "瓊州",
    "city": "新城",
    "office_x_coord": 110.35794067,
    "office_y_coord": 20.008165359
  },
  {
    "id": 2669,
    "chName": "李璵",
    "firstyear": "未詳",
    "lastyear": "未詳",
    "office_name": "萬戶府鎮撫",
    "office_address": "瓊州",
    "city": "襄陵",
    "office_x_coord": 110.35794067,
    "office_y_coord": 20.008165359
  }]
